nxp-mcuxpresso/rpmsg-lite/lib/rpmsg_lite/porting/platform/imxrt700_m33/rpmsg_platform.c
/*
 * Copyright 2024-2026 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#include <stdio.h>
#include <string.h>

#include "rpmsg_platform.h"
#include "rpmsg_env.h"

#include "fsl_device_registers.h"
#include "fsl_mu.h"
#if (defined(MIMXRT735S_cm33_core0_SERIES) || defined(MIMXRT758S_cm33_core0_SERIES) || \
     defined(MIMXRT798S_cm33_core0_SERIES))
#include "fsl_cache.h"
#include "fsl_ezhv.h"
#endif

#if defined(RL_USE_MCMGR_IPC_ISR_HANDLER) && (RL_USE_MCMGR_IPC_ISR_HANDLER == 1)
#include "mcmgr.h"
#endif

#if defined(RL_USE_ENVIRONMENT_CONTEXT) && (RL_USE_ENVIRONMENT_CONTEXT == 1)
#error "This RPMsg-Lite port requires RL_USE_ENVIRONMENT_CONTEXT set to 0"
#endif

#define APP_M33_0_M33_1_MU      MU1_MUA
#define APP_M33_0_M33_1_MU_IRQn MU1_A_IRQn
#define APP_M33_1_M33_0_MU      MU1_MUB
#define APP_M33_1_M33_0_MU_IRQn MU1_B_IRQn
#define APP_M33_0_HIFI1_MU      MU0_MUA
#define APP_M33_0_HIFI1_MU_IRQn MU0_A_IRQn
#define APP_M33_0_HIFI4_MU      MU4_MUA
#define APP_M33_0_HIFI4_MU_IRQn MU4_A_IRQn
#define APP_M33_1_HIFI1_MU      MU3_MUA
#define APP_M33_1_HIFI1_MU_IRQn MU3_A_IRQn
#define APP_M33_1_HIFI4_MU      MU2_MUB
#define APP_M33_1_HIFI4_MU_IRQn MU2_B_IRQn
#define APP_M33_0_EZHV_IRQn     EZHV_IRQn

#define APP_MU_IRQ_PRIORITY (3U)
static int32_t isr_counter0 = 0; /* RL_PLATFORM_IMXRT700_M33_0_M33_1_LINK_ID isr counter */
static int32_t isr_counter1 = 0; /* RL_PLATFORM_IMXRT700_M33_0_HIFI4_LINK_ID isr counter */
static int32_t isr_counter2 = 0; /* RL_PLATFORM_IMXRT700_M33_1_HIFI1_LINK_ID isr counter */
static int32_t isr_counter3 = 0; /* RL_PLATFORM_IMXRT700_M33_0_EZHV_LINK_ID isr counter */
static int32_t isr_counter4 = 0; /* RL_PLATFORM_IMXRT700_M33_0_HIFI1_LINK_ID isr counter */
static int32_t isr_counter5 = 0; /* RL_PLATFORM_IMXRT700_M33_1_HIFI4_LINK_ID isr counter */

static int32_t disable_counter0 = 0;
static int32_t disable_counter1 = 0;
static int32_t disable_counter2 = 0;
static int32_t disable_counter3 = 0;
static int32_t disable_counter4 = 0;
static int32_t disable_counter5 = 0;
static void *platform_lock;
#if defined(RL_USE_STATIC_API) && (RL_USE_STATIC_API == 1)
static LOCK_STATIC_CONTEXT platform_lock_static_ctxt;
#endif

#if defined(RL_USE_MCMGR_IPC_ISR_HANDLER) && (RL_USE_MCMGR_IPC_ISR_HANDLER == 1)
static void mcmgr_event_handler(mcmgr_core_t coreNum, uint16_t vring_idx, void *context)
{
    env_isr((uint32_t)vring_idx);
}

#else
#if (defined(MIMXRT735S_cm33_core0_SERIES) || defined(MIMXRT758S_cm33_core0_SERIES) || \
     defined(MIMXRT798S_cm33_core0_SERIES))
void MU0_A_IRQHandler(void)
{
    uint32_t flags;
    flags = MU_GetStatusFlags(APP_M33_0_HIFI1_MU);
    if (((uint32_t)kMU_GenInt0Flag & flags) != 0UL)
    {
        MU_ClearStatusFlags(APP_M33_0_HIFI1_MU, (uint32_t)kMU_GenInt0Flag);
        env_isr(RL_PLATFORM_IMXRT700_M33_0_HIFI1_COM_ID << 3U);
    }
    if (((uint32_t)kMU_GenInt1Flag & flags) != 0UL)
    {
        MU_ClearStatusFlags(APP_M33_0_HIFI1_MU, (uint32_t)kMU_GenInt1Flag);
        env_isr((uint32_t)(0x01U | (RL_PLATFORM_IMXRT700_M33_0_HIFI1_COM_ID << 3U)));
    }
}
void MU1_A_IRQHandler(void)
{
    uint32_t flags;
    flags = MU_GetStatusFlags(APP_M33_0_M33_1_MU);
    if (((uint32_t)kMU_GenInt0Flag & flags) != 0UL)
    {
        MU_ClearStatusFlags(APP_M33_0_M33_1_MU, (uint32_t)kMU_GenInt0Flag);
        env_isr(RL_PLATFORM_IMXRT700_M33_0_M33_1_COM_ID << 3U);
    }
    if (((uint32_t)kMU_GenInt1Flag & flags) != 0UL)
    {
        MU_ClearStatusFlags(APP_M33_0_M33_1_MU, (uint32_t)kMU_GenInt1Flag);
        env_isr((uint32_t)(0x01U | (RL_PLATFORM_IMXRT700_M33_0_M33_1_COM_ID << 3U)));
    }
}
void MU4_A_IRQHandler(void)
{
    uint32_t flags;
    flags = MU_GetStatusFlags(APP_M33_0_HIFI4_MU);
    if (((uint32_t)kMU_GenInt0Flag & flags) != 0UL)
    {
        MU_ClearStatusFlags(APP_M33_0_HIFI4_MU, (uint32_t)kMU_GenInt0Flag);
        env_isr(RL_PLATFORM_IMXRT700_M33_0_HIFI4_COM_ID << 3U);
    }
    if (((uint32_t)kMU_GenInt1Flag & flags) != 0UL)
    {
        MU_ClearStatusFlags(APP_M33_0_HIFI4_MU, (uint32_t)kMU_GenInt1Flag);
        env_isr((uint32_t)(0x01U | (RL_PLATFORM_IMXRT700_M33_0_HIFI4_COM_ID << 3U)));
    }
}
static void ezhv_callback0(void *param)
{
    env_isr(RL_PLATFORM_IMXRT700_M33_0_EZHV_COM_ID << 3U);
}
static void ezhv_callback1(void *param)
{
    env_isr((uint32_t)(0x01U | (RL_PLATFORM_IMXRT700_M33_0_EZHV_COM_ID << 3U)));
}
#elif (defined(MIMXRT735S_cm33_core1_SERIES) || defined(MIMXRT758S_cm33_core1_SERIES) || \
       defined(MIMXRT798S_cm33_core1_SERIES))
void MU1_B_IRQHandler(void)
{
    uint32_t flags;
    flags = MU_GetStatusFlags(APP_M33_1_M33_0_MU);
    if (((uint32_t)kMU_GenInt0Flag & flags) != 0UL)
    {
        MU_ClearStatusFlags(APP_M33_1_M33_0_MU, (uint32_t)kMU_GenInt0Flag);
        env_isr(RL_PLATFORM_IMXRT700_M33_0_M33_1_COM_ID << 3U);
    }
    if (((uint32_t)kMU_GenInt1Flag & flags) != 0UL)
    {
        MU_ClearStatusFlags(APP_M33_1_M33_0_MU, (uint32_t)kMU_GenInt1Flag);
        env_isr((uint32_t)(0x01U | (RL_PLATFORM_IMXRT700_M33_0_M33_1_COM_ID << 3U)));
    }
}
void MU2_B_IRQHandler(void)
{
    uint32_t flags;
    flags = MU_GetStatusFlags(APP_M33_1_HIFI4_MU);
    if (((uint32_t)kMU_GenInt0Flag & flags) != 0UL)
    {
        MU_ClearStatusFlags(APP_M33_1_HIFI4_MU, (uint32_t)kMU_GenInt0Flag);
        env_isr(RL_PLATFORM_IMXRT700_M33_0_M33_1_COM_ID << 3U);
    }
    if (((uint32_t)kMU_GenInt1Flag & flags) != 0UL)
    {
        MU_ClearStatusFlags(APP_M33_1_HIFI4_MU, (uint32_t)kMU_GenInt1Flag);
        env_isr((uint32_t)(0x01U | (RL_PLATFORM_IMXRT700_M33_0_M33_1_COM_ID << 3U)));
    }
}
void MU3_A_IRQHandler(void)
{
    uint32_t flags;
    flags = MU_GetStatusFlags(APP_M33_1_HIFI1_MU);
    if (((uint32_t)kMU_GenInt0Flag & flags) != 0UL)
    {
        MU_ClearStatusFlags(APP_M33_1_HIFI1_MU, (uint32_t)kMU_GenInt0Flag);
        env_isr(RL_PLATFORM_IMXRT700_M33_1_HIFI1_COM_ID << 3U);
    }
    if (((uint32_t)kMU_GenInt1Flag & flags) != 0UL)
    {
        MU_ClearStatusFlags(APP_M33_1_HIFI1_MU, (uint32_t)kMU_GenInt1Flag);
        env_isr((uint32_t)(0x01U | (RL_PLATFORM_IMXRT700_M33_1_HIFI1_COM_ID << 3U)));
    }
}
#endif
#endif

static void platform_global_isr_disable(void)
{
    __asm volatile("cpsid i");
}

