nxp-mcuxpresso/rpmsg-lite/lib/rpmsg_lite/porting/platform/imxrt700_m33/rpmsg_platform.c
static void platform_global_isr_enable(void)
{
    __asm volatile("cpsie i");
}

int32_t platform_init_interrupt(uint32_t vector_id, void *isr_data)
{
    if (platform_lock != ((void *)0))
    {
        /* Register ISR to environment layer */
        env_register_isr(vector_id, isr_data);

        /* Prepare the MU Hardware, enable channel 1 interrupt */
        env_lock_mutex(platform_lock);

        switch (RL_GET_COM_ID(vector_id))
        {
            case RL_PLATFORM_IMXRT700_M33_0_M33_1_COM_ID:
                RL_ASSERT(0 <= isr_counter0);
                if (isr_counter0 < 2)
                {
#if (defined(MIMXRT735S_cm33_core0_SERIES) || defined(MIMXRT758S_cm33_core0_SERIES) || \
     defined(MIMXRT798S_cm33_core0_SERIES))
                    MU_EnableInterrupts(APP_M33_0_M33_1_MU, MU_GI_INTR(1UL << (RL_GET_Q_ID(vector_id))));
#elif (defined(MIMXRT735S_cm33_core1_SERIES) || defined(MIMXRT758S_cm33_core1_SERIES) || \
       defined(MIMXRT798S_cm33_core1_SERIES))
                    MU_EnableInterrupts(APP_M33_1_M33_0_MU, MU_GI_INTR(1UL << (RL_GET_Q_ID(vector_id))));
#endif
                }
                isr_counter0++;
                break;
            case RL_PLATFORM_IMXRT700_M33_0_HIFI4_COM_ID:
                RL_ASSERT(0 <= isr_counter1);
                if (isr_counter1 < 2)
                {
#if (defined(MIMXRT735S_cm33_core0_SERIES) || defined(MIMXRT758S_cm33_core0_SERIES) || \
     defined(MIMXRT798S_cm33_core0_SERIES))
                    MU_EnableInterrupts(APP_M33_0_HIFI4_MU, MU_GI_INTR(1UL << (RL_GET_Q_ID(vector_id))));
#endif
                }
                isr_counter1++;
                break;
            case RL_PLATFORM_IMXRT700_M33_1_HIFI1_COM_ID:
                RL_ASSERT(0 <= isr_counter2);
                if (isr_counter2 < 2)
                {
#if (defined(MIMXRT735S_cm33_core1_SERIES) || defined(MIMXRT758S_cm33_core1_SERIES) || \
     defined(MIMXRT798S_cm33_core1_SERIES))
                    MU_EnableInterrupts(APP_M33_1_HIFI1_MU, MU_GI_INTR(1UL << (RL_GET_Q_ID(vector_id))));
#endif
                }
                isr_counter2++;
                break;
            case RL_PLATFORM_IMXRT700_M33_0_EZHV_COM_ID:
                RL_ASSERT(0 <= isr_counter3);
                if (isr_counter3 < 2)
                {
#if (defined(MIMXRT735S_cm33_core0_SERIES) || defined(MIMXRT758S_cm33_core0_SERIES) || \
     defined(MIMXRT798S_cm33_core0_SERIES))
                    EZHV_EnableEzhv2ArmIntChan(kEZHV_EzhvToArmIntChan0);
                    EZHV_EnableEzhv2ArmIntChan(kEZHV_EzhvToArmIntChan1);
#endif
                }
                isr_counter3++;
                break;
            case RL_PLATFORM_IMXRT700_M33_0_HIFI1_COM_ID:
                RL_ASSERT(0 <= isr_counter4);
                if (isr_counter4 < 2)
                {
#if (defined(MIMXRT735S_cm33_core0_SERIES) || defined(MIMXRT758S_cm33_core0_SERIES) || \
     defined(MIMXRT798S_cm33_core0_SERIES))
                    MU_EnableInterrupts(APP_M33_0_HIFI1_MU, MU_GI_INTR(1UL << (RL_GET_Q_ID(vector_id))));
#endif
                }
                isr_counter4++;
                break;
            case RL_PLATFORM_IMXRT700_M33_1_HIFI4_COM_ID:
                RL_ASSERT(0 <= isr_counter5);
                if (isr_counter5 < 2)
                {
#if (defined(MIMXRT735S_cm33_core1_SERIES) || defined(MIMXRT758S_cm33_core1_SERIES) || \
     defined(MIMXRT798S_cm33_core1_SERIES))
                    MU_EnableInterrupts(APP_M33_1_HIFI4_MU, MU_GI_INTR(1UL << (RL_GET_Q_ID(vector_id))));
#endif
                }
                isr_counter5++;
                break;
            default:
                /* All the cases have been listed above, the default clause should not be reached. */
                break;
        }

        env_unlock_mutex(platform_lock);
        return 0;
    }
    else
    {
        return -1;
    }
}

int32_t platform_deinit_interrupt(uint32_t vector_id)
{
    if (platform_lock != ((void *)0))
    {
        /* Prepare the MU Hardware */
        env_lock_mutex(platform_lock);

        switch (RL_GET_COM_ID(vector_id))
        {
            case RL_PLATFORM_IMXRT700_M33_0_M33_1_COM_ID:
                RL_ASSERT(0 < isr_counter0);
                isr_counter0--;
                if (isr_counter0 < 2)
                {
#if (defined(MIMXRT735S_cm33_core0_SERIES) || defined(MIMXRT758S_cm33_core0_SERIES) || \
     defined(MIMXRT798S_cm33_core0_SERIES))
                    MU_DisableInterrupts(APP_M33_0_M33_1_MU, MU_GI_INTR(1UL << (RL_GET_Q_ID(vector_id))));
#elif (defined(MIMXRT735S_cm33_core1_SERIES) || defined(MIMXRT758S_cm33_core1_SERIES) || \
       defined(MIMXRT798S_cm33_core1_SERIES))
                    MU_DisableInterrupts(APP_M33_1_M33_0_MU, MU_GI_INTR(1UL << (RL_GET_Q_ID(vector_id))));
#endif
                }
                break;
            case RL_PLATFORM_IMXRT700_M33_0_HIFI4_COM_ID:
                RL_ASSERT(0 < isr_counter1);
                isr_counter1--;
                if (isr_counter1 < 2)
                {
#if (defined(MIMXRT735S_cm33_core0_SERIES) || defined(MIMXRT758S_cm33_core0_SERIES) || \
     defined(MIMXRT798S_cm33_core0_SERIES))
                    MU_DisableInterrupts(APP_M33_0_HIFI4_MU, MU_GI_INTR(1UL << (RL_GET_Q_ID(vector_id))));
#endif
                }
                break;
            case RL_PLATFORM_IMXRT700_M33_1_HIFI1_COM_ID:
                RL_ASSERT(0 < isr_counter2);
                isr_counter2--;
                if (isr_counter2 < 2)
                {
#if (defined(MIMXRT735S_cm33_core1_SERIES) || defined(MIMXRT758S_cm33_core1_SERIES) || \
     defined(MIMXRT798S_cm33_core1_SERIES))
                    MU_DisableInterrupts(APP_M33_1_HIFI1_MU, MU_GI_INTR(1UL << (RL_GET_Q_ID(vector_id))));
#endif
                }
                break;
            case RL_PLATFORM_IMXRT700_M33_0_EZHV_COM_ID:
                RL_ASSERT(0 < isr_counter3);
                isr_counter3--;
                if (isr_counter3 < 2)
                {
#if (defined(MIMXRT735S_cm33_core0_SERIES) || defined(MIMXRT758S_cm33_core0_SERIES) || \
     defined(MIMXRT798S_cm33_core0_SERIES))
                    EZHV_DisableEzhv2ArmIntChan(kEZHV_EzhvToArmIntChan0);
                    EZHV_DisableEzhv2ArmIntChan(kEZHV_EzhvToArmIntChan1);
#endif
                }
                break;
            case RL_PLATFORM_IMXRT700_M33_0_HIFI1_COM_ID:
                RL_ASSERT(0 < isr_counter4);
                isr_counter4--;
                if (isr_counter4 < 2)
                {
#if (defined(MIMXRT735S_cm33_core0_SERIES) || defined(MIMXRT758S_cm33_core0_SERIES) || \
     defined(MIMXRT798S_cm33_core0_SERIES))
                    MU_DisableInterrupts(APP_M33_0_HIFI1_MU, MU_GI_INTR(1UL << (RL_GET_Q_ID(vector_id))));
#endif
                }
                break;
            case RL_PLATFORM_IMXRT700_M33_1_HIFI4_COM_ID:
                RL_ASSERT(0 < isr_counter5);
                isr_counter5--;
                if (isr_counter5 < 2)
                {
#if (defined(MIMXRT735S_cm33_core1_SERIES) || defined(MIMXRT758S_cm33_core1_SERIES) || \
     defined(MIMXRT798S_cm33_core1_SERIES))
                    MU_DisableInterrupts(APP_M33_1_HIFI4_MU, MU_GI_INTR(1UL << (RL_GET_Q_ID(vector_id))));
#endif
                }
                break;
            default:
                /* All the cases have been listed above, the default clause should not be reached. */
                break;
        }

        /* Unregister ISR from environment layer */
        env_unregister_isr(vector_id);

        env_unlock_mutex(platform_lock);

