nxp-mcuxpresso/rpmsg-lite/lib/rpmsg_lite/porting/platform/imxrt700_m33/rpmsg_platform.c
        return 0;
    }
    else
    {
        return -1;
    }
}

void platform_notify(uint32_t vector_id)
{
    env_lock_mutex(platform_lock);
#if defined(RL_USE_MCMGR_IPC_ISR_HANDLER) && (RL_USE_MCMGR_IPC_ISR_HANDLER == 1)
    switch (RL_GET_COM_ID(vector_id))
    {
        case RL_PLATFORM_IMXRT700_M33_0_M33_1_COM_ID:
#if (defined(MIMXRT735S_cm33_core0_SERIES) || defined(MIMXRT758S_cm33_core0_SERIES) || \
     defined(MIMXRT798S_cm33_core0_SERIES))
            (void)MCMGR_TriggerEventForce(kMCMGR_Core1, kMCMGR_RemoteRPMsgEvent, (uint16_t)(vector_id & 0xFFFFU));
#elif (defined(MIMXRT735S_cm33_core1_SERIES) || defined(MIMXRT758S_cm33_core1_SERIES) || \
       defined(MIMXRT798S_cm33_core1_SERIES))
            (void)MCMGR_TriggerEventForce(kMCMGR_Core0, kMCMGR_RemoteRPMsgEvent, (uint16_t)(vector_id & 0xFFFFU));
#endif
            break;
        case RL_PLATFORM_IMXRT700_M33_0_HIFI4_COM_ID:
#if (defined(MIMXRT735S_cm33_core0_SERIES) || defined(MIMXRT758S_cm33_core0_SERIES) || \
     defined(MIMXRT798S_cm33_core0_SERIES))
            (void)MCMGR_TriggerEventForce(kMCMGR_Core2, kMCMGR_RemoteRPMsgEvent, (uint16_t)(vector_id & 0xFFFFU));
#endif
            break;
        case RL_PLATFORM_IMXRT700_M33_1_HIFI1_COM_ID:
#if (defined(MIMXRT735S_cm33_core1_SERIES) || defined(MIMXRT758S_cm33_core1_SERIES) || \
     defined(MIMXRT798S_cm33_core1_SERIES))
            (void)MCMGR_TriggerEventForce(kMCMGR_Core3, kMCMGR_RemoteRPMsgEvent, (uint16_t)(vector_id & 0xFFFFU));
#endif
            break;
        case RL_PLATFORM_IMXRT700_M33_0_HIFI1_COM_ID:
#if (defined(MIMXRT735S_cm33_core0_SERIES) || defined(MIMXRT758S_cm33_core0_SERIES) || \
     defined(MIMXRT798S_cm33_core0_SERIES))
            (void)MCMGR_TriggerEventForce(kMCMGR_Core3, kMCMGR_RemoteRPMsgEvent, (uint16_t)(vector_id & 0xFFFFU));
#endif
            break;
        case RL_PLATFORM_IMXRT700_M33_1_HIFI4_COM_ID:
#if (defined(MIMXRT735S_cm33_core1_SERIES) || defined(MIMXRT758S_cm33_core1_SERIES) || \
     defined(MIMXRT798S_cm33_core1_SERIES))
            (void)MCMGR_TriggerEventForce(kMCMGR_Core2, kMCMGR_RemoteRPMsgEvent, (uint16_t)(vector_id & 0xFFFFU));
#endif
            break;
        default:
            /* All the cases have been listed above, the default clause should not be reached. */
            break;
    }
#else
    switch (RL_GET_COM_ID(vector_id))
    {
        case RL_PLATFORM_IMXRT700_M33_0_M33_1_COM_ID:
#if (defined(MIMXRT735S_cm33_core0_SERIES) || defined(MIMXRT758S_cm33_core0_SERIES) || \
     defined(MIMXRT798S_cm33_core0_SERIES))
            (void)MU_TriggerInterrupts(APP_M33_0_M33_1_MU, MU_GI_INTR(1UL << (RL_GET_Q_ID(vector_id))));
#elif (defined(MIMXRT735S_cm33_core1_SERIES) || defined(MIMXRT758S_cm33_core1_SERIES) || \
       defined(MIMXRT798S_cm33_core1_SERIES))
            (void)MU_TriggerInterrupts(APP_M33_1_M33_0_MU, MU_GI_INTR(1UL << (RL_GET_Q_ID(vector_id))));
#endif
            break;
        case RL_PLATFORM_IMXRT700_M33_0_HIFI4_COM_ID:
#if (defined(MIMXRT735S_cm33_core0_SERIES) || defined(MIMXRT758S_cm33_core0_SERIES) || \
     defined(MIMXRT798S_cm33_core0_SERIES))
            (void)MU_TriggerInterrupts(APP_M33_0_HIFI4_MU, MU_GI_INTR(1UL << (RL_GET_Q_ID(vector_id))));
#endif
            break;
        case RL_PLATFORM_IMXRT700_M33_1_HIFI1_COM_ID:
#if (defined(MIMXRT735S_cm33_core1_SERIES) || defined(MIMXRT758S_cm33_core1_SERIES) || \
     defined(MIMXRT798S_cm33_core1_SERIES))
            (void)MU_TriggerInterrupts(APP_M33_1_HIFI1_MU, MU_GI_INTR(1UL << (RL_GET_Q_ID(vector_id))));
#endif
            break;
        case RL_PLATFORM_IMXRT700_M33_0_HIFI1_COM_ID:
#if (defined(MIMXRT735S_cm33_core0_SERIES) || defined(MIMXRT758S_cm33_core0_SERIES) || \
     defined(MIMXRT798S_cm33_core0_SERIES))
            (void)MU_TriggerInterrupts(APP_M33_0_HIFI1_MU, MU_GI_INTR(1UL << (RL_GET_Q_ID(vector_id))));
#endif
            break;
        case RL_PLATFORM_IMXRT700_M33_1_HIFI4_COM_ID:
#if (defined(MIMXRT735S_cm33_core1_SERIES) || defined(MIMXRT758S_cm33_core1_SERIES) || \
     defined(MIMXRT798S_cm33_core1_SERIES))
            (void)MU_TriggerInterrupts(APP_M33_1_HIFI4_MU, MU_GI_INTR(1UL << (RL_GET_Q_ID(vector_id))));
#endif
            break;
        case RL_PLATFORM_IMXRT700_M33_0_EZHV_COM_ID:
#if (defined(MIMXRT735S_cm33_core0_SERIES) || defined(MIMXRT758S_cm33_core0_SERIES) || \
     defined(MIMXRT798S_cm33_core0_SERIES))
            if (RL_GET_Q_ID(vector_id))
            {
                EZHV_EnableArm2EzhvInt(kEZHV_ARM2EZHV_MEI);
            }
            else
            {
                EZHV_EnableArm2EzhvInt(kEZHV_ARM2EZHV_MSI);
            }
#endif
            break;
        default:
            /* All the cases have been listed above, the default clause should not be reached. */
            break;
    }
#endif
    env_unlock_mutex(platform_lock);
}

/**
 * platform_time_delay
 *
 * @param num_msec Delay time in ms.
 *
 * This is not an accurate delay, it ensures at least num_msec passed when return.
 */
void platform_time_delay(uint32_t num_msec)
{
    uint32_t loop;

    /* Recalculate the CPU frequency */
    SystemCoreClockUpdate();

    /* Calculate the CPU loops to delay, each loop has 3 cycles */
    loop = SystemCoreClock / 3U / 1000U * num_msec;

    /* There's some difference among toolchains, 3 or 4 cycles each loop */
    while (loop > 0U)
    {
        __NOP();
        loop--;
    }
}

/**
 * platform_in_isr
 *
 * Return whether CPU is processing IRQ
 *
 * @return True for IRQ, false otherwise.
 *
 */
int32_t platform_in_isr(void)
{
    return (((SCB->ICSR & SCB_ICSR_VECTACTIVE_Msk) != 0UL) ? 1 : 0);
}

/**
 * platform_interrupt_enable
 *
 * Enable peripheral-related interrupt
 *
 * @param vector_id Virtual vector ID that needs to be converted to IRQ number
 *
 * @return vector_id Return value is never checked.
 *
 */
int32_t platform_interrupt_enable(uint32_t vector_id)
{
    platform_global_isr_disable();
    switch (RL_GET_COM_ID(vector_id))
    {
        case RL_PLATFORM_IMXRT700_M33_0_M33_1_COM_ID:
            RL_ASSERT(0 < disable_counter0);
            disable_counter0--;
            if (disable_counter0 == 0)
            {
#if (defined(MIMXRT735S_cm33_core0_SERIES) || defined(MIMXRT758S_cm33_core0_SERIES) || \
     defined(MIMXRT798S_cm33_core0_SERIES))
#if !(defined(RL_USE_MCMGR_IPC_ISR_HANDLER) && (RL_USE_MCMGR_IPC_ISR_HANDLER == 1))
                NVIC_EnableIRQ(APP_M33_0_M33_1_MU_IRQn);
#endif
#elif (defined(MIMXRT735S_cm33_core1_SERIES) || defined(MIMXRT758S_cm33_core1_SERIES) || \
       defined(MIMXRT798S_cm33_core1_SERIES))
#if !(defined(RL_USE_MCMGR_IPC_ISR_HANDLER) && (RL_USE_MCMGR_IPC_ISR_HANDLER == 1))
                NVIC_EnableIRQ(APP_M33_1_M33_0_MU_IRQn);
#endif
#endif
            }
            break;
        case RL_PLATFORM_IMXRT700_M33_0_HIFI4_COM_ID:
            RL_ASSERT(0 < disable_counter1);
            disable_counter1--;
            if (disable_counter1 == 0)
            {
#if (defined(MIMXRT735S_cm33_core0_SERIES) || defined(MIMXRT758S_cm33_core0_SERIES) || \
     defined(MIMXRT798S_cm33_core0_SERIES))
#if !(defined(RL_USE_MCMGR_IPC_ISR_HANDLER) && (RL_USE_MCMGR_IPC_ISR_HANDLER == 1))
                NVIC_EnableIRQ(APP_M33_0_HIFI4_MU_IRQn);
#endif
#endif
            }
            break;
        case RL_PLATFORM_IMXRT700_M33_1_HIFI1_COM_ID:
            RL_ASSERT(0 < disable_counter2);
            disable_counter2--;
            if (disable_counter2 == 0)
            {
#if (defined(MIMXRT735S_cm33_core1_SERIES) || defined(MIMXRT758S_cm33_core1_SERIES) || \
     defined(MIMXRT798S_cm33_core1_SERIES))
#if !(defined(RL_USE_MCMGR_IPC_ISR_HANDLER) && (RL_USE_MCMGR_IPC_ISR_HANDLER == 1))
                NVIC_EnableIRQ(APP_M33_1_HIFI1_MU_IRQn);
#endif
#endif
            }
            break;
        case RL_PLATFORM_IMXRT700_M33_0_EZHV_COM_ID:
            RL_ASSERT(0 < disable_counter3);
            disable_counter3--;
            if (disable_counter3 == 0)
            {
#if (defined(MIMXRT735S_cm33_core0_SERIES) || defined(MIMXRT758S_cm33_core0_SERIES) || \
     defined(MIMXRT798S_cm33_core0_SERIES))
#if !(defined(RL_USE_MCMGR_IPC_ISR_HANDLER) && (RL_USE_MCMGR_IPC_ISR_HANDLER == 1))
                NVIC_EnableIRQ(APP_M33_0_EZHV_IRQn);
#endif
#endif
            }
            break;
        case RL_PLATFORM_IMXRT700_M33_0_HIFI1_COM_ID:
            RL_ASSERT(0 < disable_counter4);
            disable_counter4--;
            if (disable_counter4 == 0)
            {
#if (defined(MIMXRT735S_cm33_core0_SERIES) || defined(MIMXRT758S_cm33_core0_SERIES) || \
     defined(MIMXRT798S_cm33_core0_SERIES))
#if !(defined(RL_USE_MCMGR_IPC_ISR_HANDLER) && (RL_USE_MCMGR_IPC_ISR_HANDLER == 1))
                NVIC_EnableIRQ(APP_M33_0_HIFI1_MU_IRQn);
#endif
#endif
            }
            break;
        case RL_PLATFORM_IMXRT700_M33_1_HIFI4_COM_ID:
            RL_ASSERT(0 < disable_counter5);
            disable_counter5--;
            if (disable_counter5 == 0)
            {
#if (defined(MIMXRT735S_cm33_core1_SERIES) || defined(MIMXRT758S_cm33_core1_SERIES) || \
     defined(MIMXRT798S_cm33_core1_SERIES))
#if !(defined(RL_USE_MCMGR_IPC_ISR_HANDLER) && (RL_USE_MCMGR_IPC_ISR_HANDLER == 1))
                NVIC_EnableIRQ(APP_M33_1_HIFI4_MU_IRQn);
#endif
#endif
            }
            break;
        default:
            /* All the cases have been listed above, the default clause should not be reached. */
            break;
    }
    platform_global_isr_enable();
    return 0;
}

/**
 * platform_interrupt_disable
 *
 * Disable peripheral-related interrupt.
 *
 * @param vector_id Virtual vector ID that needs to be converted to IRQ number
 *
 * @return vector_id Return value is never checked.
 *
 */
int32_t platform_interrupt_disable(uint32_t vector_id)
{
    platform_global_isr_disable();
    /* virtqueues use the same NVIC vector
       if counter is set - the interrupts are disabled */
    switch (RL_GET_COM_ID(vector_id))
    {
        case RL_PLATFORM_IMXRT700_M33_0_M33_1_COM_ID:
            RL_ASSERT(0 <= disable_counter0);
            if (disable_counter0 == 0)
            {
#if (defined(MIMXRT735S_cm33_core0_SERIES) || defined(MIMXRT758S_cm33_core0_SERIES) || \
     defined(MIMXRT798S_cm33_core0_SERIES))
#if !(defined(RL_USE_MCMGR_IPC_ISR_HANDLER) && (RL_USE_MCMGR_IPC_ISR_HANDLER == 1))
                NVIC_DisableIRQ(APP_M33_0_M33_1_MU_IRQn);
#endif
#elif (defined(MIMXRT735S_cm33_core1_SERIES) || defined(MIMXRT758S_cm33_core1_SERIES) || \
       defined(MIMXRT798S_cm33_core1_SERIES))
#if !(defined(RL_USE_MCMGR_IPC_ISR_HANDLER) && (RL_USE_MCMGR_IPC_ISR_HANDLER == 1))
                NVIC_DisableIRQ(APP_M33_1_M33_0_MU_IRQn);
#endif
#endif
            }
            disable_counter0++;
            break;
        case RL_PLATFORM_IMXRT700_M33_0_HIFI4_COM_ID:
            RL_ASSERT(0 <= disable_counter1);
            if (disable_counter1 == 0)
            {
#if (defined(MIMXRT735S_cm33_core0_SERIES) || defined(MIMXRT758S_cm33_core0_SERIES) || \
     defined(MIMXRT798S_cm33_core0_SERIES))
#if !(defined(RL_USE_MCMGR_IPC_ISR_HANDLER) && (RL_USE_MCMGR_IPC_ISR_HANDLER == 1))
                NVIC_DisableIRQ(APP_M33_0_HIFI4_MU_IRQn);
#endif
#endif
            }
            disable_counter1++;
            break;
        case RL_PLATFORM_IMXRT700_M33_1_HIFI1_COM_ID:
            RL_ASSERT(0 <= disable_counter2);
            if (disable_counter2 == 0)
            {
#if (defined(MIMXRT735S_cm33_core1_SERIES) || defined(MIMXRT758S_cm33_core1_SERIES) || \
     defined(MIMXRT798S_cm33_core1_SERIES))
#if !(defined(RL_USE_MCMGR_IPC_ISR_HANDLER) && (RL_USE_MCMGR_IPC_ISR_HANDLER == 1))
                NVIC_DisableIRQ(APP_M33_1_HIFI1_MU_IRQn);
#endif
#endif
            }
            disable_counter2++;
            break;
        case RL_PLATFORM_IMXRT700_M33_0_EZHV_COM_ID:
            RL_ASSERT(0 <= disable_counter3);
            if (disable_counter3 == 0)
            {
#if (defined(MIMXRT735S_cm33_core0_SERIES) || defined(MIMXRT758S_cm33_core0_SERIES) || \
     defined(MIMXRT798S_cm33_core0_SERIES))
#if !(defined(RL_USE_MCMGR_IPC_ISR_HANDLER) && (RL_USE_MCMGR_IPC_ISR_HANDLER == 1))
                NVIC_DisableIRQ(APP_M33_0_EZHV_IRQn);
#endif
#endif
            }
            disable_counter3++;
            break;
        case RL_PLATFORM_IMXRT700_M33_0_HIFI1_COM_ID:
            RL_ASSERT(0 <= disable_counter4);
            if (disable_counter4 == 0)
            {
#if (defined(MIMXRT735S_cm33_core0_SERIES) || defined(MIMXRT758S_cm33_core0_SERIES) || \
     defined(MIMXRT798S_cm33_core0_SERIES))
#if !(defined(RL_USE_MCMGR_IPC_ISR_HANDLER) && (RL_USE_MCMGR_IPC_ISR_HANDLER == 1))
                NVIC_DisableIRQ(APP_M33_0_HIFI1_MU_IRQn);
#endif
#endif
            }
            disable_counter4++;
            break;
        case RL_PLATFORM_IMXRT700_M33_1_HIFI4_COM_ID:
            RL_ASSERT(0 <= disable_counter5);
            if (disable_counter5 == 0)
            {
#if (defined(MIMXRT735S_cm33_core1_SERIES) || defined(MIMXRT758S_cm33_core1_SERIES) || \
     defined(MIMXRT798S_cm33_core1_SERIES))
#if !(defined(RL_USE_MCMGR_IPC_ISR_HANDLER) && (RL_USE_MCMGR_IPC_ISR_HANDLER == 1))
                NVIC_DisableIRQ(APP_M33_1_HIFI4_MU_IRQn);
#endif
#endif
            }
            disable_counter5++;
            break;
        default:
            /* All the cases have been listed above, the default clause should not be reached. */
            break;
    }
    platform_global_isr_enable();
    return 0;
}

/**
 * platform_map_mem_region
 *
 * Dummy implementation
 *
 */
void platform_map_mem_region(uint32_t vrt_addr, uint32_t phy_addr, uint32_t size, uint32_t flags)
{
}

/**
 * platform_cache_all_flush_invalidate
 *
 * Dummy implementation
 *
 */
void platform_cache_all_flush_invalidate(void)
{
}

/**
 * platform_cache_disable
 *
 * Dummy implementation
 *
 */
void platform_cache_disable(void)
{
}

/**
 * platform_cache_flush
 *
 * Invalidates Cache.
 *
 * @param data Pointer to start of memory to flush
 * @param len Length of memory to flush
 *
 */
void platform_cache_flush(void *data, uint32_t len)
{
    if ((data == NULL) || (len == 0U))
    {
        return;
    }

    /* Cache is handled only on core0 */
#if (defined(MIMXRT735S_cm33_core0_SERIES) || defined(MIMXRT758S_cm33_core0_SERIES) || \
     defined(MIMXRT798S_cm33_core0_SERIES))
    XCACHE_CleanCacheByRange((uint32_t)(char *)data, len);
#endif
}

/**
 * platform_cache_invalidate
 *
 * Invalidates Cache.
 *
 * @param data Pointer to start of memory to invalidate
 * @param len Length of memory to invalidate
 *
 */
void platform_cache_invalidate(void *data, uint32_t len)
{
    if ((data == NULL) || (len == 0U))
    {
        return;
    }

    /* Cache is handled only on core0 */
#if (defined(MIMXRT735S_cm33_core0_SERIES) || defined(MIMXRT758S_cm33_core0_SERIES) || \
     defined(MIMXRT798S_cm33_core0_SERIES))
    XCACHE_InvalidateCacheByRange((uint32_t)(char *)data, len);
#endif
}

/**
 * platform_vatopa
 *
 * Dummy implementation
 *
 */
uintptr_t platform_vatopa(void *addr)
{
    return ((uintptr_t)(char *)addr);
}

/**
 * platform_patova
 *
 * Dummy implementation
 *
 */
void *platform_patova(uintptr_t addr)
{
    return ((void *)(char *)addr);
}

/**
 * platform_init
 *
 * platform/environment init
 */
int32_t platform_init(void)
{
#if defined(RL_USE_MCMGR_IPC_ISR_HANDLER) && (RL_USE_MCMGR_IPC_ISR_HANDLER == 1)
    mcmgr_status_t retval = kStatus_MCMGR_Error;
    retval                = MCMGR_RegisterEvent(kMCMGR_RemoteRPMsgEvent, mcmgr_event_handler, ((void *)0));

    if (kStatus_MCMGR_Success != retval)
    {
        return -1;
    }
#else
#if (defined(MIMXRT735S_cm33_core0_SERIES) || defined(MIMXRT758S_cm33_core0_SERIES) || \
     defined(MIMXRT798S_cm33_core0_SERIES))
    MU_Init(APP_M33_0_M33_1_MU);
    NVIC_SetPriority(APP_M33_0_M33_1_MU_IRQn, APP_MU_IRQ_PRIORITY);
    NVIC_EnableIRQ(APP_M33_0_M33_1_MU_IRQn);

