nxp-mcuxpresso/rpmsg-lite/lib/rpmsg_lite/porting/platform/imxrt700_m33/rpmsg_platform.c
    MU_Init(APP_M33_0_HIFI4_MU);
    NVIC_SetPriority(APP_M33_0_HIFI4_MU_IRQn, APP_MU_IRQ_PRIORITY);
    NVIC_EnableIRQ(APP_M33_0_HIFI4_MU_IRQn);

    MU_Init(APP_M33_0_HIFI1_MU);
    NVIC_SetPriority(APP_M33_0_HIFI1_MU_IRQn, APP_MU_IRQ_PRIORITY);
    NVIC_EnableIRQ(APP_M33_0_HIFI1_MU_IRQn);

    EZHV_SetCallback(ezhv_callback0, 0, NULL);
    EZHV_SetCallback(ezhv_callback1, 1, NULL);
    NVIC_SetPriority(APP_M33_0_EZHV_IRQn, APP_MU_IRQ_PRIORITY);
    NVIC_EnableIRQ(APP_M33_0_EZHV_IRQn);
#elif (defined(MIMXRT735S_cm33_core1_SERIES) || defined(MIMXRT758S_cm33_core1_SERIES) || \
       defined(MIMXRT798S_cm33_core1_SERIES))
    MU_Init(APP_M33_1_M33_0_MU);
    NVIC_SetPriority(APP_M33_1_M33_0_MU_IRQn, APP_MU_IRQ_PRIORITY);
    NVIC_EnableIRQ(APP_M33_1_M33_0_MU_IRQn);

    MU_Init(APP_M33_1_HIFI1_MU);
    NVIC_SetPriority(APP_M33_1_HIFI1_MU_IRQn, APP_MU_IRQ_PRIORITY);
    NVIC_EnableIRQ(APP_M33_1_HIFI1_MU_IRQn);

    MU_Init(APP_M33_1_HIFI4_MU);
    NVIC_SetPriority(APP_M33_1_HIFI4_MU_IRQn, APP_MU_IRQ_PRIORITY);
    NVIC_EnableIRQ(APP_M33_1_HIFI4_MU_IRQn);
#endif
#endif

    /* Create lock used in multi-instanced RPMsg */
#if defined(RL_USE_STATIC_API) && (RL_USE_STATIC_API == 1)
    if (0 != env_create_mutex(&platform_lock, 1, &platform_lock_static_ctxt))
#else
    if (0 != env_create_mutex(&platform_lock, 1))
#endif
    {
        return -1;
    }

    return 0;
}

/**
 * platform_deinit
 *
 * platform/environment deinit process
 */
int32_t platform_deinit(void)
{
#if !(defined(RL_USE_MCMGR_IPC_ISR_HANDLER) && (RL_USE_MCMGR_IPC_ISR_HANDLER == 1))
#if (defined(MIMXRT735S_cm33_core0_SERIES) || defined(MIMXRT758S_cm33_core0_SERIES) || \
     defined(MIMXRT798S_cm33_core0_SERIES))
    MU_Deinit(APP_M33_0_M33_1_MU);
    MU_Deinit(APP_M33_0_HIFI4_MU);
    MU_Deinit(APP_M33_0_HIFI1_MU);
#elif (defined(MIMXRT735S_cm33_core1_SERIES) || defined(MIMXRT758S_cm33_core1_SERIES) || \
       defined(MIMXRT798S_cm33_core1_SERIES))
    MU_Deinit(APP_M33_1_M33_0_MU);
    MU_Deinit(APP_M33_1_HIFI1_MU);
    MU_Deinit(APP_M33_1_HIFI4_MU);
#endif
#endif

    /* Delete lock used in multi-instanced RPMsg */
    env_delete_mutex(platform_lock);
    platform_lock = ((void *)0);
    return 0;
}
